SigninLogs
| where ResultType != 0
| project ResultType, ResultDescription, Identity, ConditionalAccessStatus, DeviceDetail, UserPrincipalName
| sort by UserPrincipalName

SigninLogs
| where ResultType != 0
| summarize count() by UserPrincipalName, ResultDescription
| sort by count_ desc

SigninLogs
//| project DeviceDetail, AuthenticationRequirement, ResultType
| where DeviceDetail !has "isCompliant" and AuthenticationRequirement != "multiFactorAuthentication" and ResultType == 0 and parse_json(AuthenticationDetails)[0].authenticationMethod != "Previously satisfied" and DeviceDetail.operatingSystem != "Ios" and Identity !has "sa_"

AuditLogs
//| summarize count() by ActivityDisplayName
| where OperationName == "Add app role assignment to service principal"
| project parse_json(TargetResources)[0].displayName

AuditLogs
// | summarize count() by ActivityDisplayName
| where OperationName == "Add app role assignment to service principal"
| project TimeGenerated, parse_json(InitiatedBy).user.userPrincipalName, parse_json(TargetResources)[0].displayName, parse_json(TargetResources)[0].id, parse_json(TargetResources)[0].modifiedProperties[1].newValue

AuditLogs
// | summarize count() by ActivityDisplayName
| where OperationName == "Add app role assignment to service principal"
| project TimeGenerated, parse_json(InitiatedBy).user.userPrincipalName, parse_json(TargetResources)[0].displayName, parse_json(TargetResources)[0].id, parse_json(TargetResources)[0].modifiedProperties[1].newValue


AzureDiagnostics
| where TimeGenerated > ago(30d)
| distinct ResourceType

//Detect when a new credential is added to an Azure AD application registration
//Data connector required for this query - Azure Active Directory - Audit Logs
AuditLogs
| where OperationName has "Update application – Certificates and secrets management"
| extend ApplicationName = tostring(TargetResources[0].displayName)
| extend ApplicationObjectId = tostring(TargetResources[0].id)
| extend Actor = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
| extend ActorIPAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
| project TimeGenerated, ApplicationName, ApplicationObjectId, Actor, ActorIPAddress

